;; -*- no-byte-compile: t; -*-

(package! ace-window)
(package! citar)
(package! company-posframe)
(package! company-quickhelp)
(package! ctrlf)
(package! deadgrep)
(package! dired-narrow)
(package! edraw :recipe (:host github :repo "misohena/el-easydraw" :files ("*.el")))
(package! easy-kill)
(package! emacsql-sqlite-builtin)
(package! git-link)
(package! groovy-mode)
(package! corfu)
(package! kind-icon)
(package! mathpix.el :recipe (:host github :repo "jethrokuan/mathpix.el"))
(package! explain-pause-mode :recipe (:host github :repo "lastquestion/explain-pause-mode"))
(package! current-window-only :recipe (:host github :repo "FrostyX/current-window-only"))
(package! modus-themes)
(package! multiple-cursors)
(package! org-present)
(package! org-roam :recipe (:host github :repo "org-roam/org-roam"))
(package! org-roam-bibtex)
(package! org-roam-ui)
(package! ox-hugo)
(package! ox-reveal)
(package! ox-texinfo+ :recipe (:host github :repo "tarsius/ox-texinfo-plus"))
(package! parinfer-rust-mode)
(package! redo)
(package! auto-dim-other-buffers)
(package! ripgrep)
(package! rmsbolt)
(package! rustic)
(package! super-save)
(package! swiper)
(package! thrift)
(package! tree-sitter)
(package! tree-sitter-langs)
(package! try)
;;(package! drag-stuff)
(package! multi-vterm)
(package! flycheck-clang-analyzer)
