;; -*- no-byte-compile: t; -*-
(package! all-the-icons)
(package! bazel)
(package! citar)
(package! clang-format)
(package! company-quickhelp)
(package! corfu)
(package! current-window-only :recipe (:host github :repo "FrostyX/current-window-only"))
(package! edraw :recipe (:host github :repo "misohena/el-easydraw" :files ("*.el")))
(package! explain-pause-mode :recipe (:host github :repo "lastquestion/explain-pause-mode"))
(package! flycheck-popup-tip)
(package! list-processes-plus :recipe (:host github :repo "emacsmirror/list-processes-plus"))
(package! mathpix.el :recipe (:host github :repo "jethrokuan/mathpix.el"))
(package! multiple-cursors)
(package! orderless)
(package! org-modern-indent :recipe (:host github :repo "jdtsmith/org-modern-indent"))
(package! org-present)
(package! org-roam :recipe (:host github :repo "org-roam/org-roam"))
(package! org-roam-bibtex)
(package! org-roam-ui)
(package! org-starless :recipe (:host github :repo "TonCherAmi/org-starless"))
(package! ox-hugo)
(package! ox-reveal)
(package! ox-texinfo+ :recipe (:host github :repo "tarsius/ox-texinfo-plus"))
(package! parinfer-rust-mode)
(package! pdf-tools)
(package! python-black)
(package! redo)
(package! swiper)
(package! ts-fold :recipe (:host github :repo "emacs-tree-sitter/ts-fold"))
(package! ultra-scroll :recipe(:host github :repo "jdtsmith/ultra-scroll"))
(package! xclip)
(package! zoom-window)
(package! magit-todos)
(package! compiler-explorer)
(package! treesit-auto)
